backend/app/models/user.rb

    has_many :orders

    after_create do
        self.balances.create!(amount: 500)
---
INSERT INTO "balances" ("user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["amount", 500.0], ["created_at", "2020-02-09 23:45:49.694101"], ["updated_at", "2020-02-09 23:45:49.694101"]]