backend/app/services/order_create.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]
SELECT SUM("products"."price") FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", "hbo"], ["code", "crackle"]]
SELECT "products".* FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", "hbo"], ["code", "crackle"]]
---
    def init
      @order = nil
      @user = User.find_by(username: ActiveSupport::Inflector.transliterate(params[:order][:user_id].downcase.sub(/\s+/, '').to_s))
      # QUESTION: Could there be an issue here if Product is nil?
      @products = Product.where(code: params[:order][:items])
      @total = @products.sum(:price)

SELECT "products"."code" FROM "products"
---
    def check_products_exists
      # QUESTION: Any performance concerns here by doing #.all?
      product_available = Product.all.pluck(:code)

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
    def already_purchased
      # QUESTION: Guard clause?
      unless @user.orders.nil?

SELECT SUM("balances"."amount") FROM "balances" WHERE "balances"."user_id" = $1  [["user_id", 1]]
---
    def check_balance
      fail(:insufficient_balance) if @user.balances.sum(:amount) < @total

INSERT INTO "orders" ("user_id", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["total", 96.0], ["created_at", "2020-02-09 23:45:52.203841"], ["updated_at", "2020-02-09 23:45:52.203841"]]
INSERT INTO "purchaseds" ("order_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["product_id", 3], ["created_at", "2020-02-09 23:45:52.214126"], ["updated_at", "2020-02-09 23:45:52.214126"]]
---
    def create_order
      ActiveRecord::Base.transaction do
        @order = Order.create!(user: @user, total: @total)
        @products.each do |product|
          Purchased.create!(order: @order, product: product)