backend/app/services/user_find_or_create.rb

    def find_or_create_user
      ActiveRecord::Base.transaction do
        @user = User.find_or_create_by(username: @username)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "123"], ["created_at", "2020-02-09 23:45:49.673099"], ["updated_at", "2020-02-09 23:45:49.673099"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]

    def user_products
      @user_products = []
      @user.orders.each { |order| @user_products = @user_products + order.products.pluck(:code) }
---
SELECT "products"."code" FROM "products" INNER JOIN "purchaseds" ON "products"."id" = "purchaseds"."product_id" WHERE "purchaseds"."order_id" = $1  [["order_id", 1]]

    def return
      {
        user: {
          user_id: @user.username,
          data: {
            balance: @user.balances.sum(:amount),
            product_ids: @user_products.uniq
---
SELECT SUM("balances"."amount") FROM "balances" WHERE "balances"."user_id" = $1  [["user_id", 1]]