backend/app/controllers/api/orders_controller.rb

  def create
    # check products exist and check if already purchased then calculate total
    validate_products(@products)
    @total = calculate_order_total(@products)

    # check if the user has insufficient balance and throw an error if true
    return insufficient_balance unless @user.afford?(@total)

    # create the order
    @order = PlaceOrder.call(user: @user, products: @products, total: @total)
    @product_names = @order.products.map(&:name)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]

  def set_user
    @user = User.where(username: @body['user_id'].to_s).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]