backend/app/controllers/api/users_controller.rb

  def show
    unless @user
      @user = User.create(username: "#{params[:id]}", email: "#{params[:id]}@gmail.com", password: "123456")
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "123"], ["created_at", "2020-02-09 23:45:49.673099"], ["updated_at", "2020-02-09 23:45:49.673099"]]

  def set_user
    @user = User.where(username: "#{params[:id]}").first
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]